Revit 2027 API
OptionalFunctionalityUtils.IsDGNExportAvailable Method
 Checks whether the DGN Export functionality is available in the installed Revit.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static bool IsDGNExportAvailable()
Public Shared Function IsDGNExportAvailable As Boolean
public:
static bool IsDGNExportAvailable()
static member IsDGNExportAvailable : unit -> bool
Return Value
Boolean
 True if the DGN Export functionality is available in the installed Revit.
Remarks
 DGN Export requires presence of certain modules that are optional and may not be part of the installed Revit.
See Also
Reference
OptionalFunctionalityUtils Class
Autodesk.Revit.DB Namespace